---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet
source: html/f307ccff-2fdf-706b-9020-8b674b855884.htm
---
# WireMaterialTypeSet Methods

Removes every wire material type from the set, rendering it empty.